literate/ExampleProgramTests.org
#+TITLE: Example Programs as Jest Tests
#+PROPERTY: header-args    :comments both :tangle ../test/ExamplePrograms.test.js

These are example programs written as Jest tests because it's easy, and I already have that framework written.

These tests may run slow, so they should be disabled with =it.skip= while working on the rest of the code base, to not slow down the rest of the code base tests.

* Preamble

#+begin_src js
import { interpretFile } from "../src/Interpreter";
#+end_src

* Fibonacci

#+begin_src js
it("Example - Fibonacci", async () => {
    const input = (n) => `
        fib: (n)[
            n, 1 > _, @recurse jump! 1 return!

            recurse:_

            n, 1 - _, fib! a: _
            n, 2 - _, fib! b: _

            a, b + _
        ]

        ${n}, fib! _
        `;

    expect(await interpretFile(input(0))).toEqual([ 1 ]);
    expect(await interpretFile(input(1))).toEqual([ 1 ]);
    expect(await interpretFile(input(2))).toEqual([ 2 ]);
    expect(await interpretFile(input(3))).toEqual([ 3 ]);
    expect(await interpretFile(input(4))).toEqual([ 5 ]);
    expect(await interpretFile(input(5))).toEqual([ 8 ]);
    expect(await interpretFile(input(6))).toEqual([ 13 ]);
    // expect(await interpretFile(input(7))).toEqual([ 21 ]);
    // expect(await interpretFile(input(8))).toEqual([ 34 ]);
    // expect(await interpretFile(input(9))).toEqual([ 55 ]);
});
#+end_src

* FizzBuzz

#+begin_src js
it.skip("Example - FizzBuzz", async () => {
    const input = (n) => `
        n: ${n}
        i: 0

        start:
          i, n = _, @end jump!
          i, 1 + _, @i set!

        i, 3 % _ ~ fizz: _
        i, 5 % _ ~ buzz: _
        fizz, buzz & fizzbuzz: _

        fizzbuzz, @fb jump!
        fizz, @f jump!
        buzz, @b jump!

        i print! @start jump!
        fb: "FizzBuzz" print! @start jump!
        f: "Fizz" print! @start jump!
        b: "Buzz" print! @start jump!

        end:_
        `;

    expect(await interpretFile(input(100))).toEqual([ 1 ]);
});
#+end_src
